waveshareteam/ESP32-P4-WIFI6-DB-POE-ETH/examples/Arduino/mipi_dsi/src/drivers/lcd/port/esp_lcd_jd9365_local.c
    {0x37, (uint8_t[]){0x19}, 1, 0},

    {0x38, (uint8_t[]){0x05}, 1, 0},
    {0x39, (uint8_t[]){0x00}, 1, 0},
    {0x3A, (uint8_t[]){0x01}, 1, 0},
    {0x3B, (uint8_t[]){0x01}, 1, 0},
    {0x3C, (uint8_t[]){0x70}, 1, 0},
    {0x3D, (uint8_t[]){0xFF}, 1, 0},
    {0x3E, (uint8_t[]){0xFF}, 1, 0},
    {0x3F, (uint8_t[]){0xFF}, 1, 0},

    {0x40, (uint8_t[]){0x06}, 1, 0},
    {0x41, (uint8_t[]){0xA0}, 1, 0},
    {0x43, (uint8_t[]){0x1E}, 1, 0},
    {0x44, (uint8_t[]){0x0F}, 1, 0},
    {0x45, (uint8_t[]){0x28}, 1, 0},
    {0x4B, (uint8_t[]){0x04}, 1, 0},

    //{0x4A, (uint8_t[]){0x35}, 1, 0},//bist

    {0x55, (uint8_t[]){0x02}, 1, 0},
    {0x56, (uint8_t[]){0x01}, 1, 0},
    {0x57, (uint8_t[]){0xA9}, 1, 0},
    {0x58, (uint8_t[]){0x0A}, 1, 0},
    {0x59, (uint8_t[]){0x0A}, 1, 0},
    {0x5A, (uint8_t[]){0x37}, 1, 0},
    {0x5B, (uint8_t[]){0x19}, 1, 0},

    {0x5D, (uint8_t[]){0x78}, 1, 0},
    {0x5E, (uint8_t[]){0x63}, 1, 0},
    {0x5F, (uint8_t[]){0x54}, 1, 0},
    {0x60, (uint8_t[]){0x49}, 1, 0},
    {0x61, (uint8_t[]){0x45}, 1, 0},
    {0x62, (uint8_t[]){0x38}, 1, 0},
    {0x63, (uint8_t[]){0x3D}, 1, 0},
    {0x64, (uint8_t[]){0x28}, 1, 0},
    {0x65, (uint8_t[]){0x43}, 1, 0},
    {0x66, (uint8_t[]){0x41}, 1, 0},
    {0x67, (uint8_t[]){0x43}, 1, 0},
    {0x68, (uint8_t[]){0x62}, 1, 0},
    {0x69, (uint8_t[]){0x50}, 1, 0},
    {0x6A, (uint8_t[]){0x57}, 1, 0},
    {0x6B, (uint8_t[]){0x49}, 1, 0},
    {0x6C, (uint8_t[]){0x44}, 1, 0},
    {0x6D, (uint8_t[]){0x37}, 1, 0},
    {0x6E, (uint8_t[]){0x23}, 1, 0},
    {0x6F, (uint8_t[]){0x10}, 1, 0},
    {0x70, (uint8_t[]){0x78}, 1, 0},
    {0x71, (uint8_t[]){0x63}, 1, 0},
    {0x72, (uint8_t[]){0x54}, 1, 0},
    {0x73, (uint8_t[]){0x49}, 1, 0},
    {0x74, (uint8_t[]){0x45}, 1, 0},
    {0x75, (uint8_t[]){0x38}, 1, 0},
    {0x76, (uint8_t[]){0x3D}, 1, 0},
    {0x77, (uint8_t[]){0x28}, 1, 0},
    {0x78, (uint8_t[]){0x43}, 1, 0},
    {0x79, (uint8_t[]){0x41}, 1, 0},
    {0x7A, (uint8_t[]){0x43}, 1, 0},
    {0x7B, (uint8_t[]){0x62}, 1, 0},
    {0x7C, (uint8_t[]){0x50}, 1, 0},
    {0x7D, (uint8_t[]){0x57}, 1, 0},
    {0x7E, (uint8_t[]){0x49}, 1, 0},
    {0x7F, (uint8_t[]){0x44}, 1, 0},
    {0x80, (uint8_t[]){0x37}, 1, 0},
    {0x81, (uint8_t[]){0x23}, 1, 0},
    {0x82, (uint8_t[]){0x10}, 1, 0},

    {0xE0, (uint8_t[]){0x02}, 1, 0},
    {0x00, (uint8_t[]){0x47}, 1, 0},
    {0x01, (uint8_t[]){0x47}, 1, 0},
    {0x02, (uint8_t[]){0x45}, 1, 0},
    {0x03, (uint8_t[]){0x45}, 1, 0},
    {0x04, (uint8_t[]){0x4B}, 1, 0},
    {0x05, (uint8_t[]){0x4B}, 1, 0},
    {0x06, (uint8_t[]){0x49}, 1, 0},
    {0x07, (uint8_t[]){0x49}, 1, 0},
    {0x08, (uint8_t[]){0x41}, 1, 0},
    {0x09, (uint8_t[]){0x1F}, 1, 0},
    {0x0A, (uint8_t[]){0x1F}, 1, 0},
    {0x0B, (uint8_t[]){0x1F}, 1, 0},
    {0x0C, (uint8_t[]){0x1F}, 1, 0},
    {0x0D, (uint8_t[]){0x1F}, 1, 0},
    {0x0E, (uint8_t[]){0x1F}, 1, 0},
    {0x0F, (uint8_t[]){0x5F}, 1, 0},
    {0x10, (uint8_t[]){0x5F}, 1, 0},
    {0x11, (uint8_t[]){0x57}, 1, 0},
    {0x12, (uint8_t[]){0x77}, 1, 0},
    {0x13, (uint8_t[]){0x35}, 1, 0},
    {0x14, (uint8_t[]){0x1F}, 1, 0},
    {0x15, (uint8_t[]){0x1F}, 1, 0},

    {0x16, (uint8_t[]){0x46}, 1, 0},
    {0x17, (uint8_t[]){0x46}, 1, 0},
    {0x18, (uint8_t[]){0x44}, 1, 0},
    {0x19, (uint8_t[]){0x44}, 1, 0},
    {0x1A, (uint8_t[]){0x4A}, 1, 0},
    {0x1B, (uint8_t[]){0x4A}, 1, 0},
    {0x1C, (uint8_t[]){0x48}, 1, 0},
    {0x1D, (uint8_t[]){0x48}, 1, 0},
    {0x1E, (uint8_t[]){0x40}, 1, 0},
    {0x1F, (uint8_t[]){0x1F}, 1, 0},
    {0x20, (uint8_t[]){0x1F}, 1, 0},
    {0x21, (uint8_t[]){0x1F}, 1, 0},
    {0x22, (uint8_t[]){0x1F}, 1, 0},
    {0x23, (uint8_t[]){0x1F}, 1, 0},
    {0x24, (uint8_t[]){0x1F}, 1, 0},
    {0x25, (uint8_t[]){0x5F}, 1, 0},
    {0x26, (uint8_t[]){0x5F}, 1, 0},
    {0x27, (uint8_t[]){0x57}, 1, 0},
    {0x28, (uint8_t[]){0x77}, 1, 0},
    {0x29, (uint8_t[]){0x35}, 1, 0},
    {0x2A, (uint8_t[]){0x1F}, 1, 0},
    {0x2B, (uint8_t[]){0x1F}, 1, 0},

    {0x58, (uint8_t[]){0x40}, 1, 0},
    {0x59, (uint8_t[]){0x00}, 1, 0},
    {0x5A, (uint8_t[]){0x00}, 1, 0},
    {0x5B, (uint8_t[]){0x10}, 1, 0},
    {0x5C, (uint8_t[]){0x06}, 1, 0},
    {0x5D, (uint8_t[]){0x40}, 1, 0},
    {0x5E, (uint8_t[]){0x01}, 1, 0},
    {0x5F, (uint8_t[]){0x02}, 1, 0},
    {0x60, (uint8_t[]){0x30}, 1, 0},
    {0x61, (uint8_t[]){0x01}, 1, 0},
    {0x62, (uint8_t[]){0x02}, 1, 0},
    {0x63, (uint8_t[]){0x03}, 1, 0},
    {0x64, (uint8_t[]){0x6B}, 1, 0},
    {0x65, (uint8_t[]){0x05}, 1, 0},
    {0x66, (uint8_t[]){0x0C}, 1, 0},
    {0x67, (uint8_t[]){0x73}, 1, 0},
    {0x68, (uint8_t[]){0x09}, 1, 0},
    {0x69, (uint8_t[]){0x03}, 1, 0},
    {0x6A, (uint8_t[]){0x56}, 1, 0},
    {0x6B, (uint8_t[]){0x08}, 1, 0},
    {0x6C, (uint8_t[]){0x00}, 1, 0},
    {0x6D, (uint8_t[]){0x04}, 1, 0},
    {0x6E, (uint8_t[]){0x04}, 1, 0},
    {0x6F, (uint8_t[]){0x88}, 1, 0},
    {0x70, (uint8_t[]){0x00}, 1, 0},
    {0x71, (uint8_t[]){0x00}, 1, 0},
    {0x72, (uint8_t[]){0x06}, 1, 0},
    {0x73, (uint8_t[]){0x7B}, 1, 0},
    {0x74, (uint8_t[]){0x00}, 1, 0},
    {0x75, (uint8_t[]){0xF8}, 1, 0},
    {0x76, (uint8_t[]){0x00}, 1, 0},
    {0x77, (uint8_t[]){0xD5}, 1, 0},
    {0x78, (uint8_t[]){0x2E}, 1, 0},
    {0x79, (uint8_t[]){0x12}, 1, 0},
    {0x7A, (uint8_t[]){0x03}, 1, 0},
    {0x7B, (uint8_t[]){0x00}, 1, 0},
    {0x7C, (uint8_t[]){0x00}, 1, 0},
    {0x7D, (uint8_t[]){0x03}, 1, 0},
    {0x7E, (uint8_t[]){0x7B}, 1, 0},

    {0xE0, (uint8_t[]){0x04}, 1, 0},
    {0x00, (uint8_t[]){0x0E}, 1, 0},
    {0x02, (uint8_t[]){0xB3}, 1, 0},
    {0x09, (uint8_t[]){0x60}, 1, 0},
    {0x0E, (uint8_t[]){0x2A}, 1, 0},
    {0x36, (uint8_t[]){0x59}, 1, 0},
    {0x37, (uint8_t[]){0x58}, 1, 0}, // A133
    {0x2B, (uint8_t[]){0x0F}, 1, 0}, // A133

    {0xE0, (uint8_t[]){0x00}, 1, 0},

    {0x11, (uint8_t[]){0x00}, 1, 120},

    {0x29, (uint8_t[]){0x00}, 1, 20},

    {0x35, (uint8_t[]){0x00}, 1, 0},
#elif CONFIG_BSP_LCD_TYPE_800_800_3_4_INCH
    {0xE0, (uint8_t[]){0x00}, 1, 0},

    {0xE1, (uint8_t[]){0x93}, 1, 0},
    {0xE2, (uint8_t[]){0x65}, 1, 0},
    {0xE3, (uint8_t[]){0xF8}, 1, 0},
    {0x80, (uint8_t[]){0x01}, 1, 0},

    {0xE0, (uint8_t[]){0x01}, 1, 0},

    {0x00, (uint8_t[]){0x00}, 1, 0},
    {0x01, (uint8_t[]){0x41}, 1, 0},
    {0x03, (uint8_t[]){0x10}, 1, 0},
    {0x04, (uint8_t[]){0x44}, 1, 0},

    {0x17, (uint8_t[]){0x00}, 1, 0},
    {0x18, (uint8_t[]){0xD0}, 1, 0},
    {0x19, (uint8_t[]){0x00}, 1, 0},
    {0x1A, (uint8_t[]){0x00}, 1, 0},
    {0x1B, (uint8_t[]){0xD0}, 1, 0},
    {0x1C, (uint8_t[]){0x00}, 1, 0},

    {0x24, (uint8_t[]){0xFE}, 1, 0},
    {0x35, (uint8_t[]){0x26}, 1, 0},

