waveshareteam/ESP32-P4-WIFI6-DB-POE-ETH/examples/Arduino/mipi_dsi/src/drivers/lcd/port/esp_lcd_jd9365_local.c
    {0x11, (uint8_t[]){0x00}, 1, 120},

    {0x29, (uint8_t[]){0x00}, 1, 20},
#endif
};

static esp_err_t panel_jd9365_del(esp_lcd_panel_t *panel)
{
    jd9365_panel_t *jd9365 = (jd9365_panel_t *)panel->user_data;

    if (jd9365->reset_gpio_num >= 0) {
        gpio_reset_pin(jd9365->reset_gpio_num);
    }
    // Delete MIPI DPI panel
    jd9365->del(panel);
    ESP_LOGD(TAG, "del jd9365 panel @%p", jd9365);
    free(jd9365);

    return ESP_OK;
}

static esp_err_t panel_jd9365_init(esp_lcd_panel_t *panel)
{
    jd9365_panel_t *jd9365 = (jd9365_panel_t *)panel->user_data;
    esp_lcd_panel_io_handle_t io = jd9365->io;
    const esp_panel_lcd_vendor_init_cmd_t *init_cmds = NULL;
    uint16_t init_cmds_size = 0;
    uint8_t lane_command = JD9365_DSI_2_LANE;
    bool is_user_set = true;
    bool is_cmd_overwritten = false;

    switch (jd9365->lane_num) {
    case 0:
        lane_command = JD9365_DSI_2_LANE;
        break;
    case 1:
        lane_command = JD9365_DSI_1_LANE;
        break;
    case 2:
        lane_command = JD9365_DSI_2_LANE;
        break;
    case 3:
        lane_command = JD9365_DSI_3_LANE;
        break;
    case 4:
        lane_command = JD9365_DSI_4_LANE;
        break;
    default:
        ESP_LOGE(TAG, "Invalid lane number %d", jd9365->lane_num);
        return ESP_ERR_INVALID_ARG;
    }

    uint8_t ID[3];
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_rx_param(io, 0x04, ID, 3), TAG, "read ID failed");
    printf("LCD: JD9365 read-ID transaction done, ID=%02X %02X %02X\n", ID[0], ID[1], ID[2]);
    fflush(stdout);
    ESP_LOGI(TAG, "LCD ID: %02X %02X %02X", ID[0], ID[1], ID[2]);

    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, JD9365_CMD_PAGE, (uint8_t[]) {
        JD9365_PAGE_USER
    }, 1), TAG, "send command failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, LCD_CMD_MADCTL, (uint8_t[]) {
        jd9365->madctl_val,
    }, 1), TAG, "send command failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, LCD_CMD_COLMOD, (uint8_t[]) {
        jd9365->colmod_val,
    }, 1), TAG, "send command failed");
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, JD9365_CMD_DSI_INT0, (uint8_t[]) {
        lane_command,
    }, 1), TAG, "send command failed");

    // vendor specific initialization, it can be different between manufacturers
    // should consult the LCD supplier for initialization sequence code
    if (jd9365->init_cmds) {
        init_cmds = jd9365->init_cmds;
        init_cmds_size = jd9365->init_cmds_size;
    } else {
        init_cmds = vendor_specific_init_default;
        init_cmds_size = sizeof(vendor_specific_init_default) / sizeof(esp_panel_lcd_vendor_init_cmd_t);
    }

    printf("LCD: JD9365 vendor command sequence begin, count=%u\n", (unsigned)init_cmds_size);
    fflush(stdout);

    for (int i = 0; i < init_cmds_size; i++) {
        // Check if the command has been used or conflicts with the internal
        if (is_user_set && (init_cmds[i].data_bytes > 0)) {
            switch (init_cmds[i].cmd) {
            case LCD_CMD_MADCTL:
                is_cmd_overwritten = true;
                jd9365->madctl_val = ((uint8_t *)init_cmds[i].data)[0];
                break;
            case LCD_CMD_COLMOD:
                is_cmd_overwritten = true;
                jd9365->colmod_val = ((uint8_t *)init_cmds[i].data)[0];
                break;
            default:
                is_cmd_overwritten = false;
                break;
            }

            if (is_cmd_overwritten) {
                is_cmd_overwritten = false;
                ESP_LOGW(TAG, "The %02Xh command has been used and will be overwritten by external initialization sequence",
                         init_cmds[i].cmd);
            }
        }

        // Send command
        ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, init_cmds[i].cmd, init_cmds[i].data, init_cmds[i].data_bytes), TAG, "send command failed");
        vTaskDelay(pdMS_TO_TICKS(init_cmds[i].delay_ms));

        // Check if the current cmd is the "page set" cmd
        if ((init_cmds[i].cmd == JD9365_CMD_PAGE) && (init_cmds[i].data_bytes > 0)) {
            is_user_set = (((uint8_t *)init_cmds[i].data)[0] == JD9365_PAGE_USER);
        }
    }
    ESP_LOGD(TAG, "send init commands success");

    ESP_RETURN_ON_ERROR(jd9365->init(panel), TAG, "init MIPI DPI panel failed");

    return ESP_OK;
}

static esp_err_t panel_jd9365_reset(esp_lcd_panel_t *panel)
{
    jd9365_panel_t *jd9365 = (jd9365_panel_t *)panel->user_data;
    esp_lcd_panel_io_handle_t io = jd9365->io;

    // Perform hardware reset
    if (jd9365->reset_gpio_num >= 0) {
        gpio_set_level(jd9365->reset_gpio_num, !jd9365->flags.reset_level);
        vTaskDelay(pdMS_TO_TICKS(5));
        gpio_set_level(jd9365->reset_gpio_num, jd9365->flags.reset_level);
        vTaskDelay(pdMS_TO_TICKS(10));
        gpio_set_level(jd9365->reset_gpio_num, !jd9365->flags.reset_level);
        vTaskDelay(pdMS_TO_TICKS(120));
    } else if (io) { // Perform software reset
        ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, LCD_CMD_SWRESET, NULL, 0), TAG, "send command failed");
        vTaskDelay(pdMS_TO_TICKS(120));
    }

    return ESP_OK;
}

static esp_err_t panel_jd9365_invert_color(esp_lcd_panel_t *panel, bool invert_color_data)
{
    jd9365_panel_t *jd9365 = (jd9365_panel_t *)panel->user_data;
    esp_lcd_panel_io_handle_t io = jd9365->io;
    uint8_t command = 0;

    ESP_RETURN_ON_FALSE(io, ESP_ERR_INVALID_STATE, TAG, "invalid panel IO");

    if (invert_color_data) {
        command = LCD_CMD_INVON;
    } else {
        command = LCD_CMD_INVOFF;
    }
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, command, NULL, 0), TAG, "send command failed");

    return ESP_OK;
}

static esp_err_t panel_jd9365_mirror(esp_lcd_panel_t *panel, bool mirror_x, bool mirror_y)
{
    jd9365_panel_t *jd9365 = (jd9365_panel_t *)panel->user_data;
    esp_lcd_panel_io_handle_t io = jd9365->io;
    uint8_t madctl_val = jd9365->madctl_val;

    ESP_RETURN_ON_FALSE(io, ESP_ERR_INVALID_STATE, TAG, "invalid panel IO");

    // Control mirror through LCD command
    if (mirror_x) {
        madctl_val |= JD9365_CMD_GS_BIT;
    } else {
        madctl_val &= ~JD9365_CMD_GS_BIT;
    }
    if (mirror_y) {
        madctl_val |= JD9365_CMD_SS_BIT;
    } else {
        madctl_val &= ~JD9365_CMD_SS_BIT;
    }

    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, LCD_CMD_MADCTL, (uint8_t []) {
        madctl_val
    }, 1), TAG, "send command failed");
    jd9365->madctl_val = madctl_val;

    return ESP_OK;
}

static esp_err_t panel_jd9365_disp_on_off(esp_lcd_panel_t *panel, bool on_off)
{
    jd9365_panel_t *jd9365 = (jd9365_panel_t *)panel->user_data;
    esp_lcd_panel_io_handle_t io = jd9365->io;
    int command = 0;

    if (on_off) {
        command = LCD_CMD_DISPON;
    } else {
        command = LCD_CMD_DISPOFF;
    }
    ESP_RETURN_ON_ERROR(esp_lcd_panel_io_tx_param(io, command, NULL, 0), TAG, "send command failed");
    return ESP_OK;
}
#endif

#endif // ESP_PANEL_DRIVERS_LCD_ENABLE_JD9365_LOCAL
